**Plan Results**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_group.aws_iac_contributor will be created
+   resource "aws_iam_group" "aws_iac_contributor" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "aws_iac_contributor"
+       path      = "/"
+       unique_id = (known after apply)
    }

  # aws_iam_group_policy.budgets_contributor will be created
+   resource "aws_iam_group_policy" "budgets_contributor" {
+       group  = "aws_iac_contributor"
+       id     = (known after apply)
+       name   = "budgets_contributor"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "budgets:*",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action   = [
+                           "aws-portal:ViewBilling",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = [
+                           "iam:PassRole",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "iam:PassedToService" = "budgets.amazonaws.com"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action   = [
+                           "aws-portal:ModifyBilling",
+                           "ec2:DescribeInstances",
+                           "iam:ListGroups",
+                           "iam:ListPolicies",
+                           "iam:ListRoles",
+                           "iam:ListUsers",
+                           "organizations:ListAccounts",
+                           "organizations:ListOrganizationalUnitsForParent",
+                           "organizations:ListPolicies",
+                           "organizations:ListRoots",
+                           "rds:DescribeDBInstances",
+                           "sns:ListTopics",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_group_policy.tf_state_contributor will be created
+   resource "aws_iam_group_policy" "tf_state_contributor" {
+       group  = "aws_iac_contributor"
+       id     = (known after apply)
+       name   = "tf_state_contributor"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:ListBucket"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::tfstate-jnosal"
                    },
+                   {
+                       Action   = [
+                           "s3:PutObject",
+                           "s3:GetObject",
+                           "s3:DeleteObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::tfstate-jnosal/*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_group_policy_attachment.ec2_full_access will be created
+   resource "aws_iam_group_policy_attachment" "ec2_full_access" {
+       group      = "aws_iac_contributor"
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2FullAccess"
    }

  # aws_iam_group_policy_attachment.vpc_full_access will be created
+   resource "aws_iam_group_policy_attachment" "vpc_full_access" {
+       group      = "aws_iac_contributor"
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonVPCFullAccess"
    }

  # aws_iam_user.iac_user will be created
+   resource "aws_iam_user" "iac_user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "iac_user"
+       path          = "/"
+       tags_all      = (known after apply)
+       unique_id     = (known after apply)
    }

  # aws_iam_user_group_membership.iac_user__iac_contributor will be created
+   resource "aws_iam_user_group_membership" "iac_user__iac_contributor" {
+       groups = [
+           "aws_iac_contributor",
        ]
+       id     = (known after apply)
+       user   = "iac_user"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```